&НаКлиенте
Процедура ИзмФормыПолучитьВариантРасчетаЦены()
	Если Элементы.ВариантРасчетаЦены.ТекстРедактирования = "Расчет цены по формуле" Тогда
		Элементы.Формула.Видимость=Истина;
		Элементы.Формула.Доступность=Истина;

		Элементы.А.Видимость=Истина;
		Элементы.А.Доступность=Истина;
		Элементы.ЦенаА.Видимость=Истина;
		Элементы.ЦенаА.Доступность=Истина;
		//1 
		Элементы.А1.Видимость=Истина;
		Элементы.А1.Доступность=Истина;
		Элементы.ЦенаА1.Видимость=Истина;
		Элементы.ЦенаА1.Доступность=Истина;
		//2
		Элементы.А2.Видимость=Истина;
		Элементы.А2.Доступность=Истина;
		Элементы.ЦенаА2.Видимость=Истина;
		Элементы.ЦенаА2.Доступность=Истина;
		//3
		Элементы.А3.Видимость=Истина;
		Элементы.А3.Доступность=Истина;
		Элементы.ЦенаА3.Видимость=Истина;
		Элементы.ЦенаА3.Доступность=Истина;
		//4    	
		Элементы.А4.Видимость=Истина;
		Элементы.А4.Доступность=Истина;
		Элементы.ЦенаА4.Видимость=Истина;
		Элементы.ЦенаА4.Доступность=Истина;
	Иначе
		Элементы.Формула.Видимость=Ложь;
		Элементы.Формула.Доступность=Ложь;

		Элементы.А.Видимость=Ложь;
		Элементы.А.Доступность=Ложь;
		Элементы.ЦенаА.Видимость=Ложь;
		Элементы.ЦенаА.Доступность=Ложь;
		//1 
		Элементы.А1.Видимость=Ложь;
		Элементы.А1.Доступность=Ложь;
		Элементы.ЦенаА1.Видимость=Ложь;
		Элементы.ЦенаА1.Доступность=Ложь;
		//2
		Элементы.А2.Видимость=Ложь;
		Элементы.А2.Доступность=Ложь;
		Элементы.ЦенаА2.Видимость=Ложь;
		Элементы.ЦенаА2.Доступность=Ложь;
		//3
		Элементы.А3.Видимость=Ложь;
		Элементы.А3.Доступность=Ложь;
		Элементы.ЦенаА3.Видимость=Ложь;
		Элементы.ЦенаА3.Доступность=Ложь;
		//4    	
		Элементы.А4.Видимость=Ложь;
		Элементы.А4.Доступность=Ложь;
		Элементы.ЦенаА4.Видимость=Ложь;
		Элементы.ЦенаА4.Доступность=Ложь;
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ВариантРасчетаЦеныПриИзменении(Элемент)
	ИзмФормыПолучитьВариантРасчетаЦены();
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзмФормыПолучитьВариантРасчетаЦены();
КонецПроцедуры