#Область ОбработкаВФорме

&НаКлиенте
Процедура СоставКонечногоИзделияТипСтрокиСоставаПриИзменении(Элемент)
	ТекДанные=Элементы.СоставКонечногоИзделия.ТекущиеДанные;
	ЗначениеПФ=ТекДанные.Номенклатура;
	Если ТекДанные.ТипСтрокиСостава = ПредопределенноеЗначение("Перечисление.ТипыСтрокСоставаСпецификации.Сборка") Тогда
		Для к = 1 По 15 Цикл
			Имя = "ПФ0" + Строка(к);
			ИмяВыхИзделия="ВыходноеИзделиеДляПФ" + Строка(к);
			Если Объект[Имя] = Неопределено Или ПустаяСтрока(Объект[Имя]) = Истина Тогда
				Объект[Имя]=ЗначениеПФ;
				Объект[ИмяВыхИзделия]=Объект.КонечноеИзделие;
				ТекДанные.Раздел="ПФ" + Строка(к);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	
//	СоставКонечногоИзделияТипСтрокиСоставаПриИзмененииНаСервере(Элементы.СоставКонечногоИзделия.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПФ_1ТипСтрокиСоставаПриИзменении(Элемент)
	ТекДанные=Элементы.СоставКонечногоИзделия.ТекущиеДанные;
	ЗначениеПФ=ТекДанные.Номенклатура;
	Если ТекДанные.ТипСтрокиСостава = ПредопределенноеЗначение("Перечисление.ТипыСтрокСоставаСпецификации.Сборка") Тогда
		Для к = 2 По 15 Цикл
			Имя = "ПФ0" + Строка(к);
			ИмяВыхИзделия="ПФ" + Строка(к);
			Если Объект[Имя] = Неопределено Тогда
				Объект[Имя]=ЗначениеПФ;
				Объект[ИмяВыхИзделия]=Объект.КонечноеИзделие;
				ТекДанные.Раздел="ПФ" + Строка(к);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПФ_2ТипСтрокиСоставаПриИзменении(Элемент)
	ТекДанные=Элементы.СоставКонечногоИзделия.ТекущиеДанные;
	ЗначениеПФ=ТекДанные.Номенклатура;
	Если ТекДанные.ТипСтрокиСостава = ПредопределенноеЗначение("Перечисление.ТипыСтрокСоставаСпецификации.Сборка") Тогда
		Для к = 3 По 15 Цикл
			Имя = "ПФ0" + Строка(к);
			ИмяВыхИзделия="ПФ" + Строка(к);
			Если Объект[Имя] = Неопределено Тогда
				Объект[Имя]=ЗначениеПФ;
				Объект[ИмяВыхИзделия]=Объект.КонечноеИзделие;
				ТекДанные.Раздел="ПФ" + Строка(к);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ПФ_3ТипСтрокиСоставаПриИзменении(Элемент)
	ТекДанные=Элементы.СоставКонечногоИзделия.ТекущиеДанные;
	ЗначениеПФ=ТекДанные.Номенклатура;
	Если ТекДанные.ТипСтрокиСостава = ПредопределенноеЗначение("Перечисление.ТипыСтрокСоставаСпецификации.Сборка") Тогда
		Для к = 3 По 15 Цикл
			Имя = "ПФ0" + Строка(к);
			ИмяВыхИзделия="ПФ" + Строка(к);
			Если Объект[Имя] = Неопределено Тогда
				Объект[Имя]=ЗначениеПФ;
				Объект[ИмяВыхИзделия]=Объект.КонечноеИзделие;
				ТекДанные.Раздел="ПФ" + Строка(к);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ПФ_4ТипСтрокиСоставаПриИзменении(Элемент)
	ТекДанные=Элементы.СоставКонечногоИзделия.ТекущиеДанные;
	ЗначениеПФ=ТекДанные.Номенклатура;
	Если ТекДанные.ТипСтрокиСостава = ПредопределенноеЗначение("Перечисление.ТипыСтрокСоставаСпецификации.Сборка") Тогда
		Для к = 4 По 15 Цикл
			Имя = "ПФ0" + Строка(к);
			ИмяВыхИзделия="ПФ" + Строка(к);
			Если Объект[Имя] = Неопределено Тогда
				Объект[Имя]=ЗначениеПФ;
				Объект[ИмяВыхИзделия]=Объект.КонечноеИзделие;
				ТекДанные.Раздел="ПФ" + Строка(к);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ПФ_5ТипСтрокиСоставаПриИзменении(Элемент)
	ТекДанные=Элементы.СоставКонечногоИзделия.ТекущиеДанные;
	ЗначениеПФ=ТекДанные.Номенклатура;
	Если ТекДанные.ТипСтрокиСостава = ПредопределенноеЗначение("Перечисление.ТипыСтрокСоставаСпецификации.Сборка") Тогда
		Для к = 5 По 15 Цикл
			Имя = "ПФ0" + Строка(к);
			ИмяВыхИзделия="ПФ" + Строка(к);
			Если Объект[Имя] = Неопределено Тогда
				Объект[Имя]=ЗначениеПФ;
				Объект[ИмяВыхИзделия]=Объект.КонечноеИзделие;
				ТекДанные.Раздел="ПФ" + Строка(к);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ПФ_6ТипСтрокиСоставаПриИзменении(Элемент)
	ТекДанные=Элементы.СоставКонечногоИзделия.ТекущиеДанные;
	ЗначениеПФ=ТекДанные.Номенклатура;
	Если ТекДанные.ТипСтрокиСостава = ПредопределенноеЗначение("Перечисление.ТипыСтрокСоставаСпецификации.Сборка") Тогда
		Для к = 6 По 15 Цикл
			Имя = "ПФ0" + Строка(к);
			ИмяВыхИзделия="ПФ" + Строка(к);
			Если Объект[Имя] = Неопределено Тогда
				Объект[Имя]=ЗначениеПФ;
				Объект[ИмяВыхИзделия]=Объект.КонечноеИзделие;
				ТекДанные.Раздел="ПФ" + Строка(к);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ПФ_7ТипСтрокиСоставаПриИзменении(Элемент)
	ТекДанные=Элементы.СоставКонечногоИзделия.ТекущиеДанные;
	ЗначениеПФ=ТекДанные.Номенклатура;
	Если ТекДанные.ТипСтрокиСостава = ПредопределенноеЗначение("Перечисление.ТипыСтрокСоставаСпецификации.Сборка") Тогда
		Для к = 7 По 15 Цикл
			Имя = "ПФ0" + Строка(к);
			ИмяВыхИзделия="ПФ" + Строка(к);
			Если Объект[Имя] = Неопределено Тогда
				Объект[Имя]=ЗначениеПФ;
				Объект[ИмяВыхИзделия]=Объект.КонечноеИзделие;
				ТекДанные.Раздел="ПФ" + Строка(к);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура СформироватьСпецификацииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСпецификации(Команда)
	СформироватьСпецификацииНаСервере();
КонецПроцедуры