&НаСервере
Процедура ДобавитьТаблицуЗначенийНаСервере()

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТаблицуЗначений(Команда)
	ДобавитьТаблицуЗначенийНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоставКонечногоИзделияТипСтрокиСоставаПриИзмененииНаСервере(ТекДанные)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоставКонечногоИзделияТипСтрокиСоставаПриИзменении(Элемент)
	ТекДанные=Элементы.СоставКонечногоИзделия.ТекущиеДанные;
	ЗначениеПФ=ТекДанные.Номенклатура;
	Если ТекДанные.ТипСтрокиСостава = ПредопределенноеЗначение("Перечисление.ТипыСтрокСоставаСпецификации.Сборка") Тогда
		Для к = 1 По 15 Цикл
			Имя = "ПФ0" + Строка(к);
			ИмяВыхИзделия="ПФ0" + Строка(к);
			Если Объект[Имя] = Неопределено Тогда
				Объект[Имя]=ЗначениеПФ;
				Объект[ИмяВыхИзделия]=Объект.КонечноеИзделие;
				ТекДанные.Раздел="ПФ" + Строка(к);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	
//	СоставКонечногоИзделияТипСтрокиСоставаПриИзмененииНаСервере(Элементы.СоставКонечногоИзделия.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ПФ16ТипСтрокиСоставаПриИзменении(Элемент)
	ТекДанные=Элементы.СоставКонечногоИзделия.ТекущиеДанные;
	ЗначениеПФ=ТекДанные.Номенклатура;
	Если ТекДанные.ТипСтрокиСостава = ПредопределенноеЗначение("Перечисление.ТипыСтрокСоставаСпецификации.Сборка") Тогда
		Для к = 1 По 15 Цикл
			Имя = "ПФ0" + Строка(к);
			ИмяВыхИзделия="ПФ" + Строка(к);
			Если Объект[Имя] = Неопределено Тогда
				Объект[Имя]=ЗначениеПФ;
				Объект[ИмяВыхИзделия]=Объект.КонечноеИзделие;
				ТекДанные.Раздел="ПФ" + Строка(к);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры