Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПланП_ИсторияЦенМатериаловВРасчетах
	Движения.ПланП_ИсторияЦенМатериаловВРасчетах.Записывать = Истина;
	Для Каждого ТекСтрокаСоставИзделия Из СоставИзделия Цикл
		Движение = Движения.ПланП_ИсторияЦенМатериаловВРасчетах.Добавить();
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаСоставИзделия.Материал;
		Движение.Цена = ТекСтрокаСоставИзделия.СтоимостьМатериала;
	КонецЦикла;
	Для Каждого ТекСтрокаНоменклатураВОперациях Из НоменклатураВОперациях Цикл
		Движение = Движения.ПланП_ИсторияЦенМатериаловВРасчетах.Добавить();
		Движение.Период = Дата;
		Движение.Материал = ТекСтрокаНоменклатураВОперациях.Номенклатура;
		Движение.Цена = ТекСтрокаНоменклатураВОперациях.ЦенаЗакупки;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры