&НаСервере
Функция ПолучитьДополнительныеОперации(Операция)
	Запрос=Новый Запрос;
	Запрос.Текст= "ВЫБРАТЬ
				  |	ФормулыРасчетаОпераций.ЦенаА КАК ЦенаА,
				  |	ФормулыРасчетаОпераций.ЦенаА1 КАК ЦенаА1,
				  |	ФормулыРасчетаОпераций.ЦенаА2 КАК ЦенаА2,
				  |	ФормулыРасчетаОпераций.ЦенаА3 КАК ЦенаА3,
				  |	ФормулыРасчетаОпераций.ЦенаА4 КАК ЦенаА4
				  |ИЗ
				  |	РегистрСведений.ФормулыРасчетаОпераций КАК ФормулыРасчетаОпераций
				  |ГДЕ
				  |	ФормулыРасчетаОпераций.Операция = &Операция";
	Запрос.Параметры.Вставить("Операция", Операция);
	Выборка=Запрос.Выполнить().Выбрать();
	Массив=Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтрДопОперации= Новый Структура;
		СтрДопОперации.Вставить("ЦенаА", Выборка.ЦенаА);
		СтрДопОперации.Вставить("ЦенаА1", Выборка.ЦенаА1);
		СтрДопОперации.Вставить("ЦенаА2", Выборка.ЦенаА2);
		СтрДопОперации.Вставить("ЦенаА3", Выборка.ЦенаА3);
		СтрДопОперации.Вставить("ЦенаА4", Выборка.ЦенаА4);
		Массив.Добавить(СтрДопОперации);
	КонецЦикла;
	Возврат Массив;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Запись.Период=ТекущаяДата();
	Запись.Автор = Пользователи.ТекущийПользователь();

КонецПроцедуры
&НаКлиенте
Процедура ИзменениеНаименованийКолонокДО(МассивДопОпер)
	Если МассивДопОпер.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если Не ПустаяСтрока(МассивДопОпер[0].ЦенаА) Тогда
		ЭтаФорма.Элементы.ЦенаА.Заголовок=МассивДопОпер[0].ЦенаА;
	КонецЕсли;
//1
	Если Не ПустаяСтрока(МассивДопОпер[0].ЦенаА1) Тогда
		ЭтаФорма.Элементы.ЦенаА1.Заголовок=МассивДопОпер[0].ЦенаА1;
	КонецЕсли;
//2
	Если Не ПустаяСтрока(МассивДопОпер[0].ЦенаА2) Тогда
		ЭтаФорма.Элементы.ЦенаА2.Заголовок=МассивДопОпер[0].ЦенаА2;
	КонецЕсли;
//3
	Если Не ПустаяСтрока(МассивДопОпер[0].ЦенаА3) Тогда
		ЭтаФорма.Элементы.ЦенаА3.Заголовок=МассивДопОпер[0].ЦенаА3;
	КонецЕсли;
//4
	Если Не ПустаяСтрока(МассивДопОпер[0].ЦенаА4) Тогда
		ЭтаФорма.Элементы.ЦенаА4.Заголовок=МассивДопОпер[0].ЦенаА4;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВспомогательнаяОперацияПриИзменении(Элемент)
	МассивДопОпер=ПолучитьДополнительныеОперации(Запись.Операция);
	ИзменениеНаименованийКолонокДО(МассивДопОпер);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МассивДопОпер=ПолучитьДополнительныеОперации(Запись.Операция);
	ИзменениеНаименованийКолонокДО(МассивДопОпер);
КонецПроцедуры