&НаСервере
Функция СоздатьЗаказКлиентаНаСервере(Расчет)
	Заказ=Документы.ЗаказПокупателя.СоздатьДокумент();
	Заказ.Дата=ТекущаяДата();
	Заказ.Контрагент=Расчет.Клиент;
	Заказ.ВидЗаказа=Справочники.ВидыЗаказовПокупателей.Основной;
	Заказ.ВидОперации=Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу;
	Заказ.Организация=Расчет.Организация;
	НовСтрокаЗаказ=Заказ.Запасы.Добавить();
	НовСтрокаЗаказ.Номенклатура=Расчет.КонечноеИзделие;
	НовСтрокаЗаказ.Количество=Расчет.Количество;
	НовСтрокаЗаказ.ЕдиницаИзмерения=Расчет.ЕдИзм;
	НовСтрокаЗаказ.Сумма=Расчет.СуммаДокумента;
	Попытка
		НовСтрокаЗаказ.Цена=Расчет.СуммаДокумента / Расчет.Количество;
	Исключение
	КонецПопытки;
	НовСтрокаЗаказ.ПланП_РасчетИзделия=Расчет.Ссылка;
	Заказ.Записать();
//ОткрытьЗначение(Заказ.Ссылка);
	// Вставить содержимое обработчика.
	Возврат Заказ.Ссылка;
КонецФункции

&НаКлиенте
Процедура СоздатьЗаказКлиента(Команда)
	СсылкаНаРасчет = Элементы.Список.ТекущаяСтрока;
	СсылкаНаОбъект=СоздатьЗаказКлиентаНаСервере(СсылкаНаРасчет);
	//Заказ.ОткрытьФорму
//стрПараметры = Новый Структура("Ключ", СсылкаНаОбъект);
//ОткрытьФорму("Документ.План_РасчетИзделия.Форма.ФормаДокумента",стрПараметры);
//	
//	ОткрытьЗначение(СсылкаНаОбъект); 
КонецПроцедуры