Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПланП_ПланПроизводстваНаПериод.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланП_ПланПроизводстваНаПериод.Дата,
	|	ПланП_ПланПроизводстваНаПериод.НачалоПериода,
	|	ПланП_ПланПроизводстваНаПериод.Номер,
	|	ПланП_ПланПроизводстваНаПериод.ОкончаниеПериода,
	|	ПланП_ПланПроизводстваНаПериод.ПланПроизводстваПоРесурсам.(
	|		НомерСтроки,
	|		ЗаказНаПроизводство,
	|		Заказ,
	|		Клиент,
	|		ЭтапПроизводства,
	|		РесурсПредприятия,
	|		Старт,
	|		Финиш
	|	)
	|ИЗ
	|	Документ.ПланП_ПланПроизводстваНаПериод КАК ПланП_ПланПроизводстваНаПериод
	|ГДЕ
	|	ПланП_ПланПроизводстваНаПериод.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПланПроизводстваПоРесурсамШапка = Макет.ПолучитьОбласть("ПланПроизводстваПоРесурсамШапка");
	ОбластьПланПроизводстваПоРесурсам = Макет.ПолучитьОбласть("ПланПроизводстваПоРесурсам");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПланПроизводстваПоРесурсамШапка);
		ВыборкаПланПроизводстваПоРесурсам = Выборка.ПланПроизводстваПоРесурсам.Выбрать();
		Пока ВыборкаПланПроизводстваПоРесурсам.Следующий() Цикл
			ОбластьПланПроизводстваПоРесурсам.Параметры.Заполнить(ВыборкаПланПроизводстваПоРесурсам);
			ТабДок.Вывести(ОбластьПланПроизводстваПоРесурсам, ВыборкаПланПроизводстваПоРесурсам.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры